Конфигурация отчетов/Enums/ТипЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипЗадач</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШаблонДляЗаполнения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Enums/ФункциональныйТипПлана.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ФункциональныйТипПлана</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПланПроект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланЗадача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Enums/ТипЗадач/Ext/ManagerModule.bsl
Функция ОпределитьФункцТипЗадачи(СсылкаНаЗадачу) Экспорт
	ТекЗадача = СсылкаНаЗадачу.ПолучитьОбъект();
	Если ТекЗадача.ТипЗадачи = Перечисления.ТипЗадач.ШаблонДляЗаполнения Тогда
		Возврат Перечисления.ФункциональныйТипПлана.ПланПроект;
	Иначе
		Возврат Перечисления.ФункциональныйТипПлана.ПланЗадача;
	КонецЕсли;
	
КонецФункции
